"""
    Задание 2.01
    Создать переменные firstname, lastname, age с соответствующими значениями
    Путем сложения получить строку вида
    Привет, меня зовут Иван Иванов, мне 35 лет
    Примечание:
    Переменную age задавать как строку ‘35’
"""
first_name = 'Иван'
last_name = 'Иванов'
age = '35'
print(f'Привет, меня зовут {first_name} {last_name}, мне {age} лет')

