"""
    Задание 2.02
    Создать два списка произвольного содержания.
    Добавить к каждому списку по одному элементу в конец и в начало.
    Расширить первый список вторым.
    Все изменения выводить на экран.
"""
fist_list = [34, 43, 56, 2, 6]
second_list = [3, 7, -9, 777]
print(fist_list.append(18))
fist_list[0]= 23
print(fist_list)
print(second_list.append(77))
second_list[0] = -99
print(second_list)

